# Курсовая работа № 2
## Аналитика. Начальный уровень

Курсовая работа состоит из двух частей – обязательной и дополнительной. **Для зачета необходимо выполнение только первой части.** Выполнение второй части может потребовать дополнительные знания Python.

- [Часть первая](#Часть-первая)
- [Часть вторая](#Часть-вторая)

## Часть первая


Перед вами стоит задача – подготовить аналитический отчет для HR-отдела. На основании проведенной аналитики предполагается составить рекомендации для отдела кадров по стратегии набора персонала, а также по взаимодействию с уже имеющимися сотрудниками.
<br><br> В базе данных лежит набор таблиц, которые содержат данные о сотрудниках вымышленной компании.
Сделайте обзор штата сотрудников компании. Составьте набор предметов исследования, а затем проверьте их на данных. Вся аналитика должна быть выполена с помощью SQL. Впоследствии данные можно визуализировать, однако финальные датафреймы для графиков также должны быть подготовлены с помощью SQL. <br><br>

Примеры гипотез:
1. Есть зависимость между `perfomance score` и тем, под чьим руководством работает сотрудник.
2. Есть зависимость между продолжительностью работы в компании и семейным положением сотрудника.
2. Есть зависимость между продолжительностью работы в компании и возрастом сотрудника.

<br><br>
Параметры для подключения следующие: хост – `dsstudents.skillbox.ru`, порт – `5432`, имя базы данных – `human_resources`, пользователь – `readonly`, пароль – `6hajV34RTQfmxhS`. Таблицы, доступные для анализа, – `hr_dataset`, `production_staff`, `recruiting_costs`, `salary_grid`.

In [1]:
# Импорт бибилотек
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import urllib.request as req
import json
import sqlalchemy
import psycopg2
import math

In [2]:
# Подключение базы данных human_resources:
conn = 'postgresql+psycopg2://readonly:6hajV34RTQfmxhS@dsstudents.skillbox.ru:5432/human_resources'

engine = sqlalchemy.create_engine(conn)
connect = engine.connect()

In [3]:
# Запрос на таблицу hr_dataset
df_hr = pd.read_sql("select * from hr_dataset", connect)
df_hr.head(3)

,id,Employee Name,Employee Number,marriedid,maritalstatusid,genderid,empstatus_id,deptid,perf_scoreid,age,...,Date of Hire,Days Employed,Date of Termination,Reason For Term,Employment Status,department,position,Manager Name,Employee Source,Performance Score
0,1,"Brown, Mia",1103024456,1,1,0,1,1,3,30,...,2008-10-27,3317,None,N/A - still employed,Active,Admin Offices,Accountant I,Brandon R. LeBlanc,Diversity Job Fair,Fully Meets
1,2,"LaRotonda, William",1106026572,0,2,1,1,1,3,34,...,2014-01-06,1420,None,N/A - still employed,Active,Admin Offices,Accountant I,Brandon R. LeBlanc,Website Banner Ads,Fully Meets
2,3,"Steans, Tyrone",1302053333,0,0,1,1,1,3,31,...,2014-09-29,1154,None,N/A - still employed,Active,Admin Offices,Accountant I,Brandon R. LeBlanc,Internet Search,Fully Meets

In [4]:
# Запрос на таблицу production_staff
df_staff = pd.read_sql("select * from production_staff", connect)
df_staff.head(3)

,id,Employee Name,Race Desc,Date of Hire,TermDate,Reason for Term,Employment Status,Department,Position,Pay,Manager Name,Performance Score,Abutments/Hour Wk 1,Abutments/Hour Wk 2,Daily Error Rate,90-day Complaints
0,1,"Albert, Michael",White,2011-08-01,None,N/A - still employed,Active,Production,Production Manager,$54.50,Elisa Bramante,Fully Meets,0.0,0.0,0.0,0.0
1,2,"Bozzi, Charles",Asian,2013-09-30,2014-08-07,retiring,Voluntarily Terminated,Production,Production Manager,$50.50,Elisa Bramante,Fully Meets,0.0,0.0,0.0,0.0
2,3,"Butler, Webster L",White,2016-01-28,None,N/A - still employed,Active,Production,Production Manager,$55.00,Elisa Bramante,Exceeds,0.0,0.0,0.0,0.0

In [5]:
# Запрос на таблицу recruiting_costs
df_costs = pd.read_sql("select * from recruiting_costs", connect)
df_costs.head(3)

,id,Employment Source,January,February,March,April,May,June,July,August,September,October,November,December,Total
0,1,Billboard,520,520,520,520,0,0,612,612,729,749,910,500,6192
1,2,Careerbuilder,410,410,410,820,820,410,410,820,820,1230,820,410,7790
2,3,Company Intranet - Partner,0,0,0,0,0,0,0,0,0,0,0,0,0

In [6]:
# Запрос на таблицу salary_grid
df_salary = pd.read_sql("select * from salary_grid", connect)
df_salary.head(3)

,id,Position,Salary Min,Salary Mid,Salary Max,Hourly Min,Hourly Mid,Hourly Max
0,1,Administrative Assistant,30000,40000,50000,14.42,19.23,24.04
1,2,Sr. Administrative Assistant,35000,45000,55000,16.83,21.63,26.44
2,3,Accountant I,42274,51425,62299,20.32,24.72,29.95

In [7]:
# У белых выше зп

df01 = pd.read_sql("""\
    SELECT ps."Race Desc",
           SUM("Pay") as average_pay\
      FROM production_staff ps\
      WHERE ps."Race Desc" IS NOT NULL\
      GROUP BY ps."Race Desc"\
     ORDER BY average_pay DESC\
     LIMIT 10""", connect)

df01

                          Race Desc average_pay
0                             White   $3,218.89
1         Black or African American     $723.60
2                             Asian     $501.70
3                 Two or more races     $185.26
4                          Hispanic      $96.00
5  American Indian or Alaska Native      $65.50

Ожидаемо, уровень оплаты труда белых в разы выше остальных.

In [8]:
# Зависимость продолжительности работы от пола

df02 = pd.read_sql("""\
    SELECT hd."genderid",\
           AVG("Days Employed")\
      FROM hr_dataset hd\
      GROUP BY hd."genderid"
     LIMIT 10""", connect)

df02

   genderid          avg
0         0  1313.457627
1         1  1272.954887

Различие малозначимо.

In [9]:
# Зависимость продолжительности работы от менеджера
df03 = pd.read_sql("""\
    SELECT ps."Manager Name",\
           AVG(hd."Days Employed") as days_average\
      FROM hr_dataset hd\
      JOIN production_staff ps\
        ON hd."Employee Name" = ps."Employee Name"\
  GROUP BY ps."Manager Name"\
  ORDER BY AVG(hd."Days Employed")\
     LIMIT 10""", connect)

df03

     Manager Name  days_average
0  Kissy Sullivan   1046.954545
1        Amy Dunn   1077.952381
2  Webster Butler   1125.190476
3  Michael Albert   1150.347826
4   David Stanley   1327.750000
5   Kelley Spirea   1387.272727
6    Elijiah Gray   1400.217391
7   Ketsia Liebig   1489.952381
8  Elisa Bramante   1509.000000
9  Brannon Miller   1591.761905

Вероятно Kissy Sullivan более деспотична :)

In [10]:
# Зависимость продолжительности и оплаты по виду деятельности
df04 = pd.read_sql("""\
    SELECT ps."Position",\
           AVG(hd."Days Employed") as avg_days,\
           AVG(ps."Pay"::numeric) as avg_pay\
      FROM hr_dataset hd\
      JOIN production_staff ps\
        ON hd."Employee Name" = ps."Employee Name"\
  GROUP BY ps."Position"\
  ORDER BY avg_days
     LIMIT 10""", connect)

df04

                   Position     avg_days    avg_pay
0  Production Technician II  1102.701754  25.407719
1   Production Technician I  1364.226277  19.132920
2        Production Manager  1509.000000  49.607143

У production manager'ов в среднем выше оплата и продолжительность работы.

In [44]:
# У подчинённых какого менеджера больше жалоб

df05 = pd.read_sql("""\
    SELECT ps."Manager Name",\
     COUNT(ps."90-day Complaints") as complaints\
      FROM production_staff ps\
  GROUP BY ps."Manager Name"\
  ORDER BY complaints DESC\
     LIMIT 15""", connect)

df05

      Manager Name  complaints
0   Michael Albert          23
1     Elijiah Gray          23
2    Kelley Spirea          22
3   Webster Butler          21
4    David Stanley          21
5   Kissy Sullivan          21
6         Amy Dunn          21
7   Brannon Miller          21
8    Ketsia Liebig          21
9   Elisa Bramante          14
10            None           0

In [14]:
# Есть ли связь между возрастом и количеством ошибок
pd.read_sql("""
    SELECT CASE
               WHEN hd."age">= 25 AND hd."age" <= 35 THEN '25 - 35'
               WHEN hd."age"> 35 AND hd."age" <= 45 THEN '36 - 45'
               WHEN hd."age"> 45 AND hd."age" <= 55 THEN '46 - 55'
               WHEN hd."age"> 55 AND hd."age" <= 67 THEN '56 - 67'
               ELSE 'NA'
           END AS ageRange,
           AVG(ps."Daily Error Rate") as error_rate
      FROM hr_dataset hd
 LEFT JOIN production_staff ps
        ON hd."Employee Name" = ps."Employee Name"
  GROUP BY ageRange
  ORDER BY ageRange
     LIMIT 15
            """, connect)

  agerange  error_rate
0  25 - 35    0.900000
1  36 - 45    0.905882
2  46 - 55    0.900000
3  56 - 67    1.000000

In [15]:
# Проверка

df_age = df_hr.merge(df_staff, how='left', on=['Employee Name', 'Performance Score'])

bins = [25, 35, 45, 55, 67]
df_age['age_range'] = pd.cut(df_age['age'], bins=bins)
df_age.groupby(['age_range'])[['Daily Error Rate']].agg('mean')

           Daily Error Rate
age_range
(25, 35]           0.898734
(35, 45]           0.905882
(45, 55]           0.900000
(55, 67]           1.000000

Ещё бы понять, что за значения 1-4 в 'Daily Error Rate'.

In [16]:
# Кто чаще ошибается, мужчины или женщины?

df07 = pd.read_sql("""
    SELECT CASE WHEN hd."genderid" = 1 THEN 'Woman' ELSE 'Man' END,
           AVG(ps."Daily Error Rate") as error_rate
      FROM hr_dataset hd
      JOIN production_staff ps
        ON hd."Employee Name" = ps."Employee Name"
  GROUP BY hd."genderid"
  ORDER BY hd."genderid" DESC
            """, connect)
df07

    case  error_rate
0  Woman    0.687500
1    Man    1.047244

Мужчины ошибаются в полтора раза чаще ))

In [43]:
# У какого менеджера в данный момент больше подчинённых, нуждающихся в улучшении показателей или в процессе улучшения

df08 = pd.read_sql("""
    SELECT ps."Manager Name",
           COUNT(ps."Employee Name") AS Employees
      FROM production_staff ps
     WHERE ps."Employment Status" = 'Active'
       AND (ps."Performance Score" = 'Needs Improvement'
        OR ps."Performance Score" = 'PIP')
     GROUP BY ps."Manager Name"
  ORDER BY Employees DESC
            """, connect)
df08

     Manager Name  employees
0  Michael Albert          3
1  Brannon Miller          2
2        Amy Dunn          1
3  Elisa Bramante          1

## Часть вторая

Перед вами стоит задача – подготовить аналитический ответ для SMM-отдела компании Skillbox. <br> Объектом анализа является  [паблик Skillbox Вконтакте](https://vk.com/skillbox_education). <br> <br> 
Подключитесь к  API VK и выгрузите посты со стены паблика Skillbox за интересующий период (определите самостоятельно и обоснуйте). Проанализируйте влияние различных факторов (например, времени публикации) на вовлеченность пользователей (количество лайков, комментариев, голосов в опросах). Сделайте аналитику по рубрикам (примеры рубрик: дизайн-битва, игра по управлению), которые есть в паблике. Выбрать нужные посты можно с помощью регулярных выражений. Составьте перечень рекомандаций для SMM-отдела по итогам анализа. <br> <br> 

Дополнительные инструкции по работе с API VK расположены [здесь](https://colab.research.google.com/drive/1rRaTay-OSPLAOX8V9UaFvTiAciVtp2s3).

In [10]:
import requests
from datetime import datetime, timedelta

In [11]:
def getjson(url):
    response = requests.get(url)
    response = response.json()
    return response

vk_token = '300c1c90af2c28713b42056acad5678468ec1ea841a6d316cd440636600951590a0310a783e60f51377c3'



url = 'https://api.vk.com/method/account.getProfileInfo?access_token=' + str(vk_token) + '&v=5.92'
response = getjson(url)

print(response)

# https://oauth.vk.com/blank.html#access_token=300c1c90af2c28713b42056acad5678468ec1ea841a6d316cd440636600951590a0310a783e60f51377c3

{'response': {'first_name': 'Иван', 'id': 12701438, 'last_name': 'Козловский', 'home_town': 'Москва', 'status': 'www.gromteam.ru', 'bdate': '9.5.1945', 'bdate_visibility': 0, 'city': {'id': 1, 'title': 'Москва'}, 'country': {'id': 1, 'title': 'Россия'}, 'phone': '+7 *** *** ** 04', 'relation': 0, 'relation_requests': [{'first_name': 'Ксения', 'id': 213683778, 'last_name': 'Воскресенская', 'can_access_closed': True, 'is_closed': False}], 'screen_name': 'art_bcs', 'sex': 2}}

In [12]:
# получаем последнюю запись из паблика Skillbox Вконтакте
url = 'https://api.vk.com/method/wall.get?access_token=' + str(vk_token) + '&owner_id=-66669811&count=1&v=5.92'
response = getjson(url)

print(response)

{'response': {'count': 3319, 'items': [{'id': 145637, 'from_id': -66669811, 'owner_id': -66669811, 'date': 1611566018, 'marked_as_ads': 0, 'post_type': 'post', 'text': 'Привет! На этой неделе расскажем, как увеличить прибыль компании, вместе с вами напишем первое приложение на iOS и объясним, как стать художником в геймдеве.\n\nЖдем вас! \n\nВыбирайте интересующие вебинары и подключайтесь: \n👉 https://vk.cc/aAdmbz\n\n#Расписание_Skillbox', 'attachments': [{'type': 'photo', 'photo': {'album_id': -7, 'date': 1611566018, 'id': 457514115, 'owner_id': -66669811, 'has_tags': False, 'access_key': 'f0e64b5802b995f3c7', 'sizes': [{'height': 82, 'url': 'https://sun1-95.userapi.com/impg/ULajuotKe_GyyClu2NFPUPDAkbuKtgQc42mhXQ/Oq9cLyZqzqI.jpg?size=130x82&quality=96&sign=659452e96ac6de9e137a8377a99dd5c3&c_uniq_tag=hGfTS5oO0nH8ZA6eSeD_Mmpns0WIFSr8ejYWvSbL27U&type=album', 'type': 'm', 'width': 130}, {'height': 87, 'url': 'https://sun1-95.userapi.com/impg/ULajuotKe_GyyClu2NFPUPDAkbuKtgQc42mhXQ/Oq9cLyZqzqI.jpg?size=130x87&quality=96&crop=58,0,1884,1261&sign=99a555fe91792416f331ce9d850aaa58&c_uniq_tag=gcektYhMOCM0z7U_NgTmox6OZS7jj4ciXNt2DXHs7CE&type=album', 'type': 'o', 'width': 130}, {'height': 133, 'url': 'https://sun1-95.userapi.com/impg/ULajuotKe_GyyClu2NFPUPDAkbuKtgQc42mhXQ/Oq9cLyZqzqI.jpg?size=200x133&quality=96&crop=52,0,1896,1261&sign=b02f2f938e92a9bc6de1b5aafa542ee0&c_uniq_tag=cqK7dFVKrLiMHXuLXOLYAmboFAeEK8z66Xptg2-NTMs&type=album', 'type': 'p', 'width': 200}, {'height': 213, 'url': 'https://sun1-95.userapi.com/impg/ULajuotKe_GyyClu2NFPUPDAkbuKtgQc42mhXQ/Oq9cLyZqzqI.jpg?size=320x213&quality=96&crop=53,0,1894,1261&sign=3ad78c14aa9e72dbfcbb3f3dd246e84a&c_uniq_tag=kL3ZEAtWCgEc3lvPEfRiymxTVLh_B0dHVTHIk4y6zeE&type=album', 'type': 'q', 'width': 320}, {'height': 340, 'url': 'https://sun1-95.userapi.com/impg/ULajuotKe_GyyClu2NFPUPDAkbuKtgQc42mhXQ/Oq9cLyZqzqI.jpg?size=510x340&quality=96&crop=54,0,1892,1261&sign=0a9909520db39e687791992d50b3d3fd&c_uniq_tag=fXqQdVL0apYic8Y9LsIzVsAqOwZ0lhkakc2W6koWa4M&type=album', 'type': 'r', 'width': 510}, {'height': 47, 'url': 'https://sun1-95.userapi.com/impg/ULajuotKe_GyyClu2NFPUPDAkbuKtgQc42mhXQ/Oq9cLyZqzqI.jpg?size=75x47&quality=96&sign=37382d1fb9c997e0a5bb7263a76eb5d6&c_uniq_tag=5XE2X1P6WQMqu7CkCIeJlVZIs0ahpPNFoKyvspH0Z5A&type=album', 'type': 's', 'width': 75}, {'height': 1261, 'url': 'https://sun1-95.userapi.com/impg/ULajuotKe_GyyClu2NFPUPDAkbuKtgQc42mhXQ/Oq9cLyZqzqI.jpg?size=2000x1261&quality=96&proxy=1&sign=50537425c5b417596ec2c40d94638e93&c_uniq_tag=l7visUBnWPY9QZahdkPOl2RzgzdOtpuoqNTmME2jeOY&type=album', 'type': 'w', 'width': 2000}, {'height': 381, 'url': 'https://sun1-95.userapi.com/impg/ULajuotKe_GyyClu2NFPUPDAkbuKtgQc42mhXQ/Oq9cLyZqzqI.jpg?size=604x381&quality=96&sign=376b13aa3f6d28261e75f5b9182516f4&c_uniq_tag=C8zZcvDrR38wvWGSjGMZVCygueSTGKtMt5YWiMeT90Y&type=album', 'type': 'x', 'width': 604}, {'height': 509, 'url': 'https://sun1-95.userapi.com/impg/ULajuotKe_GyyClu2NFPUPDAkbuKtgQc42mhXQ/Oq9cLyZqzqI.jpg?size=807x509&quality=96&sign=8d23944d5769d152a5234d688b68d29a&c_uniq_tag=m8amMnYbaeWWG8ZeBqjSL-qJD6BaygxBqQEM0QhxLcA&type=album', 'type': 'y', 'width': 807}, {'height': 807, 'url': 'https://sun1-95.userapi.com/impg/ULajuotKe_GyyClu2NFPUPDAkbuKtgQc42mhXQ/Oq9cLyZqzqI.jpg?size=1280x807&quality=96&sign=e44c0f1891f71ae3fdd5ed8ec4838e3d&c_uniq_tag=E0gNpMel-IxWh7bHcCZxAy0DWAtdIapStH6MkQoQJaA&type=album', 'type': 'z', 'width': 1280}], 'text': '', 'user_id': 100}}, {'type': 'photo', 'photo': {'album_id': -7, 'date': 1611566018, 'id': 457514116, 'owner_id': -66669811, 'has_tags': False, 'access_key': '9d7308b33e48b5a03c', 'sizes': [{'height': 82, 'url': 'https://sun1-19.userapi.com/impg/A4knwILStMxCaUtINXQ18cIPifYr8xej9HJ8Aw/ooeY1BIP1qk.jpg?size=130x82&quality=96&sign=7f89dafb436c63cf2b4d9d0a8f44d72d&c_uniq_tag=3MoDWXLARCuRiL3hA30tPMagbmK4Fry8FZh6aV-hiMc&type=album', 'type': 'm', 'width': 130}, {'height': 87, 'url': 'https://sun1-19.userapi.com/impg/A4knwILStMxCaUtINXQ18cIPifYr8xej9HJ8Aw/ooeY1BIP1qk.jpg?size=130x87&quality=96&crop=58,0,1884,1261&sign=c105d0fc3e0e10f02338fd161346e2a5&c_uniq_tag=fQ0apxVFUhZCVxL6wAYzJUqSUl6a3HjAE6-XabDwPqM&type=album', 'type': 'o', 'width': 130}, {'height': 133, 'url': 'https://sun1-19.userapi.com/impg/A4knwILStMxCaUtINXQ18cIPifYr8xej9HJ8Aw/ooeY1BIP1qk.jpg?size=200x133&quality=96&crop=52,0,1896,1261&sign=0b06a0060fa3f836670e40f9d1122227&c_uniq_tag=s6NP8UQ24gqlohFgg6P7Byr8RwbABk2Nck1tElCotHQ&type=album', 'type': 'p', 'width': 200}, {'height': 213, 'url': 'https://sun1-19.userapi.com/impg/A4knwILStMxCaUtINXQ18cIPifYr8xej9HJ8Aw/ooeY1BIP1qk.jpg?size=320x213&quality=96&crop=53,0,1894,1261&sign=3c706f6b63d09f720d9b071affed165c&c_uniq_tag=5SarRIjCs2HVI4pbPc5lcm0TFySb7yB5IBJwswp9pwk&type=album', 'type': 'q', 'width': 320}, {'height': 340, 'url': 'https://sun1-19.userapi.com/impg/A4knwILStMxCaUtINXQ18cIPifYr8xej9HJ8Aw/ooeY1BIP1qk.jpg?size=510x340&quality=96&crop=54,0,1892,1261&sign=678cabed4b49573165551fd8a849ecfd&c_uniq_tag=oGdNljqaFpmN7FZEfnRGs1Xfv3FGMcsvsKIUk7VTxk0&type=album', 'type': 'r', 'width': 510}, {'height': 47, 'url': 'https://sun1-19.userapi.com/impg/A4knwILStMxCaUtINXQ18cIPifYr8xej9HJ8Aw/ooeY1BIP1qk.jpg?size=75x47&quality=96&sign=6a0e5a2421ddd2b628f02e290f03b292&c_uniq_tag=7mNdZnMDDLlcc2xCmIYCkK0rIvKm1f2IuQXHGsdvHkI&type=album', 'type': 's', 'width': 75}, {'height': 1261, 'url': 'https://sun1-19.userapi.com/impg/A4knwILStMxCaUtINXQ18cIPifYr8xej9HJ8Aw/ooeY1BIP1qk.jpg?size=2000x1261&quality=96&proxy=1&sign=9b3594cb12195fa971d52cf8eefc6e06&c_uniq_tag=TK-5Wu9cLLjGlrmN4hzEUP5Es0rRiQi4x4zHxYLf8ko&type=album', 'type': 'w', 'width': 2000}, {'height': 381, 'url': 'https://sun1-19.userapi.com/impg/A4knwILStMxCaUtINXQ18cIPifYr8xej9HJ8Aw/ooeY1BIP1qk.jpg?size=604x381&quality=96&sign=49598eec5d65e9dd24bbe8e1509dccf9&c_uniq_tag=_z0s8SPgjmiUWczablgizw6zhppb_Vjq4qPnhN40258&type=album', 'type': 'x', 'width': 604}, {'height': 509, 'url': 'https://sun1-19.userapi.com/impg/A4knwILStMxCaUtINXQ18cIPifYr8xej9HJ8Aw/ooeY1BIP1qk.jpg?size=807x509&quality=96&sign=c267a4227d44f980704ba7704371b90e&c_uniq_tag=-rZMlsYdkMR1i945RfQJCzavwxIyNIH2eGciZqocjGY&type=album', 'type': 'y', 'width': 807}, {'height': 807, 'url': 'https://sun1-19.userapi.com/impg/A4knwILStMxCaUtINXQ18cIPifYr8xej9HJ8Aw/ooeY1BIP1qk.jpg?size=1280x807&quality=96&sign=63e90feed3268441b5534d4961208d3b&c_uniq_tag=4Hz53894VRiZScJz4Ikn5LMRtl3kREYWaJUaoqQ6YBo&type=album', 'type': 'z', 'width': 1280}], 'text': '', 'user_id': 100}}], 'post_source': {'type': 'api'}, 'comments': {'count': 0, 'can_post': 1, 'groups_can_post': True}, 'likes': {'count': 3, 'user_likes': 0, 'can_like': 1, 'can_publish': 1}, 'reposts': {'count': 3, 'user_reposted': 0}, 'views': {'count': 3308}, 'is_favorite': False}]}}

In [20]:
# сдвигаем запрос и получаем предпоследнюю запись из паблика Skillbox Вконтакте
n=2
url = 'https://api.vk.com/method/wall.get?access_token=' + str(vk_token) + f'&owner_id=-66669811&offset={n}&count=1&v=5.92'
response = getjson(url)

print(response)

{'response': {'count': 3319, 'items': [{'id': 145284, 'from_id': -66669811, 'owner_id': -66669811, 'date': 1611403474, 'marked_as_ads': 0, 'post_type': 'post', 'text': 'В 1952 году вышла первая в истории компьютерная игра OXO — аналог «крестиков-ноликов». Выглядела она как зеленая сетка на черном фоне и такие же зеленые символы. В то время это было нечто поразительное.\n\nА сегодня игр стало так много, что не удивишь даже отменной графикой. Но есть исключения — игры, каждый кадр которых до мурашек прекрасен. О них рассказываем в карточках.\n\n#Skillbox_геймдев #Подборка_игр_Skillbox', 'attachments': [{'type': 'photo', 'photo': {'album_id': -7, 'date': 1611403474, 'id': 457514021, 'owner_id': -66669811, 'has_tags': False, 'access_key': '97d4d618f9e8b629d4', 'sizes': [{'height': 130, 'url': 'https://sun1-47.userapi.com/impg/0ruukSfjN5hPAiqy3-2LfObFL4vQ2jAhtSRLow/-4-Dru6Np98.jpg?size=104x130&quality=96&sign=b1c24f0766393f0306a80655e7b17b70&c_uniq_tag=bj65k7owogB0UPrew7EZJxQVEdFA7hmA5syQkoPge0Q&type=album', 'type': 'm', 'width': 104}, {'height': 163, 'url': 'https://sun1-47.userapi.com/impg/0ruukSfjN5hPAiqy3-2LfObFL4vQ2jAhtSRLow/-4-Dru6Np98.jpg?size=130x163&quality=96&sign=47a84672ecf251e06224cdbc8b7a26c9&c_uniq_tag=XgUoPYww2gnrMpU54AYujgQuv9X81n60JvbPEaAZ0ZY&type=album', 'type': 'o', 'width': 130}, {'height': 250, 'url': 'https://sun1-47.userapi.com/impg/0ruukSfjN5hPAiqy3-2LfObFL4vQ2jAhtSRLow/-4-Dru6Np98.jpg?size=200x250&quality=96&sign=a99bfce1afc4e5e4e54b47ecc351e45f&c_uniq_tag=eOmgTTAPLur5x98J_Ynl7b3Tt3cP8WQCK4pxP5ZcYHM&type=album', 'type': 'p', 'width': 200}, {'height': 400, 'url': 'https://sun1-47.userapi.com/impg/0ruukSfjN5hPAiqy3-2LfObFL4vQ2jAhtSRLow/-4-Dru6Np98.jpg?size=320x400&quality=96&sign=565e7032087e6deae5d2f4efe9bf1bc7&c_uniq_tag=mC8UdQeTSZZX1CG8yse9tK2uThCU01Mo38UHGZ7c_ok&type=album', 'type': 'q', 'width': 320}, {'height': 638, 'url': 'https://sun1-47.userapi.com/impg/0ruukSfjN5hPAiqy3-2LfObFL4vQ2jAhtSRLow/-4-Dru6Np98.jpg?size=510x638&quality=96&sign=897c3368fc29c771148d5c3d9bf170b2&c_uniq_tag=kqTyFUrE-IKp_gkHQVBz9ToMUVmjdONYy0ouiMPI2-Y&type=album', 'type': 'r', 'width': 510}, {'height': 75, 'url': 'https://sun1-47.userapi.com/impg/0ruukSfjN5hPAiqy3-2LfObFL4vQ2jAhtSRLow/-4-Dru6Np98.jpg?size=60x75&quality=96&sign=3bc35f92d3f19dfdab123e52640e5274&c_uniq_tag=Qp5eN7zoG2dVDOev9I12QKZl2YKsmXXoTwyJ4zLnx1Q&type=album', 'type': 's', 'width': 60}, {'height': 1350, 'url': 'https://sun1-47.userapi.com/impg/0ruukSfjN5hPAiqy3-2LfObFL4vQ2jAhtSRLow/-4-Dru6Np98.jpg?size=1080x1350&quality=96&proxy=1&sign=30f234178ad6357af9f9ed383821382d&c_uniq_tag=-fWxxTERtbPD5FsWd0Lx625A-zGKuV4hwiKtAyk96fo&type=album', 'type': 'w', 'width': 1080}, {'height': 604, 'url': 'https://sun1-47.userapi.com/impg/0ruukSfjN5hPAiqy3-2LfObFL4vQ2jAhtSRLow/-4-Dru6Np98.jpg?size=483x604&quality=96&sign=2dd5a0c5292cfc2b47104e83e525b958&c_uniq_tag=ZzDGBPT684Kj0S-1Nt9ahIBsamO3VNRFlcu5YKGnfuI&type=album', 'type': 'x', 'width': 483}, {'height': 807, 'url': 'https://sun1-47.userapi.com/impg/0ruukSfjN5hPAiqy3-2LfObFL4vQ2jAhtSRLow/-4-Dru6Np98.jpg?size=646x807&quality=96&sign=1a515b41b857a01f673fce4ba57c43ba&c_uniq_tag=yqMp1EehwcM0mQ_zx92fBQiE6_Exc7V7fiO7CjScEF0&type=album', 'type': 'y', 'width': 646}, {'height': 1080, 'url': 'https://sun1-47.userapi.com/impg/0ruukSfjN5hPAiqy3-2LfObFL4vQ2jAhtSRLow/-4-Dru6Np98.jpg?size=864x1080&quality=96&sign=51c7b1d8813e78573879c822333f7b71&c_uniq_tag=MTquQthJtWMZ-nFh-lADhhXdXULDWHhg4-uCOTNZbEU&type=album', 'type': 'z', 'width': 864}], 'text': '', 'user_id': 100}}, {'type': 'photo', 'photo': {'album_id': -7, 'date': 1611403474, 'id': 457514022, 'owner_id': -66669811, 'has_tags': False, 'access_key': '9ac7e817194dd15db9', 'sizes': [{'height': 130, 'url': 'https://sun1-27.userapi.com/impg/N8RdconWNZC7xoh2r4ct3pVpmvLyYqvimV4wsg/ZpagmRsEvnI.jpg?size=104x130&quality=96&sign=c07896e408ffd5868789104932176f3f&c_uniq_tag=7NepXrcEMrO8jOdl1BQe6EyQ61HbsCf7AG-9cbzmzYo&type=album', 'type': 'm', 'width': 104}, {'height': 163, 'url': 'https://sun1-27.userapi.com/impg/N8RdconWNZC7xoh2r4ct3pVpmvLyYqvimV4wsg/ZpagmRsEvnI.jpg?size=130x163&quality=96&sign=112aef16db777d5b6f45d22a76428bc5&c_uniq_tag=pxDU0f4rT-2lkessfaw-wAuBv3g8bDY8w3qdFBlu2Sk&type=album', 'type': 'o', 'width': 130}, {'height': 250, 'url': 'https://sun1-27.userapi.com/impg/N8RdconWNZC7xoh2r4ct3pVpmvLyYqvimV4wsg/ZpagmRsEvnI.jpg?size=200x250&quality=96&sign=0b67cf8987c1cbce1341a53742f5c8ef&c_uniq_tag=9O3swje2KlP9HkOagOLwImFC3BlqSGUlA87VkFei37g&type=album', 'type': 'p', 'width': 200}, {'height': 400, 'url': 'https://sun1-27.userapi.com/impg/N8RdconWNZC7xoh2r4ct3pVpmvLyYqvimV4wsg/ZpagmRsEvnI.jpg?size=320x400&quality=96&sign=713ffa620f1a1d4aa456dacfd7c95837&c_uniq_tag=ZJvQKWA8qsC2J1LqFlsP1efNvvL9EN4mvqpgpoY2R7k&type=album', 'type': 'q', 'width': 320}, {'height': 638, 'url': 'https://sun1-27.userapi.com/impg/N8RdconWNZC7xoh2r4ct3pVpmvLyYqvimV4wsg/ZpagmRsEvnI.jpg?size=510x638&quality=96&sign=339460ccea84d62e8b2f62f10d7293dc&c_uniq_tag=p9kgqCCOR0Omk8_cGDyk5AEaPuAjPdnAtVxWewyoOlc&type=album', 'type': 'r', 'width': 510}, {'height': 75, 'url': 'https://sun1-27.userapi.com/impg/N8RdconWNZC7xoh2r4ct3pVpmvLyYqvimV4wsg/ZpagmRsEvnI.jpg?size=60x75&quality=96&sign=249bc759f29b24d6337a7f32e1dac104&c_uniq_tag=x7tuvOq6RsY-8LBQTPSJOwwbADF2BNy6teRYOgo3SPg&type=album', 'type': 's', 'width': 60}, {'height': 1350, 'url': 'https://sun1-27.userapi.com/impg/N8RdconWNZC7xoh2r4ct3pVpmvLyYqvimV4wsg/ZpagmRsEvnI.jpg?size=1080x1350&quality=96&proxy=1&sign=9983fa86d62b3bb431c912f150e03933&c_uniq_tag=PltgkJYP1C6ydAbeIZ4dU-Y0rlVdY0kmN_e3KP9fsPM&type=album', 'type': 'w', 'width': 1080}, {'height': 604, 'url': 'https://sun1-27.userapi.com/impg/N8RdconWNZC7xoh2r4ct3pVpmvLyYqvimV4wsg/ZpagmRsEvnI.jpg?size=483x604&quality=96&sign=3d0bafb1051d8eda021c859772ffacc4&c_uniq_tag=zgEWdd-epU8AxYVDn2IHE00Gvw0EGZU61lG0AW1tuk4&type=album', 'type': 'x', 'width': 483}, {'height': 807, 'url': 'https://sun1-27.userapi.com/impg/N8RdconWNZC7xoh2r4ct3pVpmvLyYqvimV4wsg/ZpagmRsEvnI.jpg?size=646x807&quality=96&sign=11a554aa239dada37f4deb83e0334354&c_uniq_tag=AwQPgoRFEz1Ad7AofwY1UHxqmi29zyfrvVsl3kjA2VM&type=album', 'type': 'y', 'width': 646}, {'height': 1080, 'url': 'https://sun1-27.userapi.com/impg/N8RdconWNZC7xoh2r4ct3pVpmvLyYqvimV4wsg/ZpagmRsEvnI.jpg?size=864x1080&quality=96&sign=82d75e0d56f0edc13371a306b4d65f47&c_uniq_tag=jr_BeETDb4DVYrSyr9YEOz008J9qOI9EgfOxt4fh0KY&type=album', 'type': 'z', 'width': 864}], 'text': '', 'user_id': 100}}, {'type': 'photo', 'photo': {'album_id': -7, 'date': 1611403474, 'id': 457514023, 'owner_id': -66669811, 'has_tags': False, 'access_key': 'd194030841953a47ee', 'sizes': [{'height': 130, 'url': 'https://sun1-99.userapi.com/impg/KaezSDxuCZ7_gMm5Q4OmCBxUCvODCkQwunn3HQ/t_QmIQDfc5A.jpg?size=104x130&quality=96&sign=2df192a4d109a4f937b181b2a7b888c1&c_uniq_tag=0Un5xjfp8lLcTJVI-kMO4ERXBgygskTzGvtfwXwUFtc&type=album', 'type': 'm', 'width': 104}, {'height': 163, 'url': 'https://sun1-99.userapi.com/impg/KaezSDxuCZ7_gMm5Q4OmCBxUCvODCkQwunn3HQ/t_QmIQDfc5A.jpg?size=130x163&quality=96&sign=fa779b58adf957858b12270326558676&c_uniq_tag=4GTQpd_LGPujtQjlXfC_eji3sClhBUhXts4oM16Vtu8&type=album', 'type': 'o', 'width': 130}, {'height': 250, 'url': 'https://sun1-99.userapi.com/impg/KaezSDxuCZ7_gMm5Q4OmCBxUCvODCkQwunn3HQ/t_QmIQDfc5A.jpg?size=200x250&quality=96&sign=d30474c2375486f060c9373aa3620ede&c_uniq_tag=yEugVQg_71O89jyIvEPeeGT398bxXRqLyZH5TnVMFCQ&type=album', 'type': 'p', 'width': 200}, {'height': 400, 'url': 'https://sun1-99.userapi.com/impg/KaezSDxuCZ7_gMm5Q4OmCBxUCvODCkQwunn3HQ/t_QmIQDfc5A.jpg?size=320x400&quality=96&sign=fcd4429ca69f2d752c677067a4bc7192&c_uniq_tag=hH1eZsCFgXooOCoj1xeDWAGs4840_U9Y3iCJjg21OV0&type=album', 'type': 'q', 'width': 320}, {'height': 638, 'url': 'https://sun1-99.userapi.com/impg/KaezSDxuCZ7_gMm5Q4OmCBxUCvODCkQwunn3HQ/t_QmIQDfc5A.jpg?size=510x638&quality=96&sign=b3e5c3437dd5201a8cfef91bbda19bd1&c_uniq_tag=1LnxFwnJtmltqAfGFvs4h-5E5nDbXNq9wb6iY77ldSM&type=album', 'type': 'r', 'width': 510}, {'height': 75, 'url': 'https://sun1-99.userapi.com/impg/KaezSDxuCZ7_gMm5Q4OmCBxUCvODCkQwunn3HQ/t_QmIQDfc5A.jpg?size=60x75&quality=96&sign=a1c5baf3269d26859831b3dffe89fea4&c_uniq_tag=lRT2qMx5cKMC8ERWDE38MDKXGzXbj8lATn7HrcHYCFo&type=album', 'type': 's', 'width': 60}, {'height': 1350, 'url': 'https://sun1-99.userapi.com/impg/KaezSDxuCZ7_gMm5Q4OmCBxUCvODCkQwunn3HQ/t_QmIQDfc5A.jpg?size=1080x1350&quality=96&proxy=1&sign=bc3f889740b30979d22f964a2476bb42&c_uniq_tag=ESxGiX0OJ2blYTSnlDwq6ya1LFLDmNMoBofwRff5mys&type=album', 'type': 'w', 'width': 1080}, {'height': 604, 'url': 'https://sun1-99.userapi.com/impg/KaezSDxuCZ7_gMm5Q4OmCBxUCvODCkQwunn3HQ/t_QmIQDfc5A.jpg?size=483x604&quality=96&sign=4d0f05f4a93d479817541d51152dafee&c_uniq_tag=Z3FWS_-dmZ74lcIYYfqk2B4NCjwS1Fq17XZiP7gnRxU&type=album', 'type': 'x', 'width': 483}, {'height': 807, 'url': 'https://sun1-99.userapi.com/impg/KaezSDxuCZ7_gMm5Q4OmCBxUCvODCkQwunn3HQ/t_QmIQDfc5A.jpg?size=646x807&quality=96&sign=1b4d804848cd8e772ab5a6d4ea3d2d84&c_uniq_tag=azTXgXIv6hp1YwZ8hvQIZj6ZIzC2HX6u7tHoM3L92DM&type=album', 'type': 'y', 'width': 646}, {'height': 1080, 'url': 'https://sun1-99.userapi.com/impg/KaezSDxuCZ7_gMm5Q4OmCBxUCvODCkQwunn3HQ/t_QmIQDfc5A.jpg?size=864x1080&quality=96&sign=d5be2d0f80f432415c9763bf290884c1&c_uniq_tag=73me21OodLHCadcUebmckzkFjcGrF9dhLi_v-h2tKpM&type=album', 'type': 'z', 'width': 864}], 'text': '', 'user_id': 100}}, {'type': 'photo', 'photo': {'album_id': -7, 'date': 1611403474, 'id': 457514024, 'owner_id': -66669811, 'has_tags': False, 'access_key': 'a0515a8823ab75a5a0', 'sizes': [{'height': 130, 'url': 'https://sun1-99.userapi.com/impg/_OsTsnycnl5ymGUVLtsV5e51NO0PtyjKwTdzVQ/Q7d4xDXYtPs.jpg?size=104x130&quality=96&sign=cfe44e07059bb121de740444ed43eb86&c_uniq_tag=VtR0x-w1P8fujSS1sk5YaiGfchWqs0Fu6uqkJ2yVAlA&type=album', 'type': 'm', 'width': 104}, {'height': 163, 'url': 'https://sun1-99.userapi.com/impg/_OsTsnycnl5ymGUVLtsV5e51NO0PtyjKwTdzVQ/Q7d4xDXYtPs.jpg?size=130x163&quality=96&sign=0af93c945a77cf9d25d0426112c850ac&c_uniq_tag=OmkrvqfRVLXJ1X44P5cD_pkGtI1ygR9zwKlD_XGt6H4&type=album', 'type': 'o', 'width': 130}, {'height': 250, 'url': 'https://sun1-99.userapi.com/impg/_OsTsnycnl5ymGUVLtsV5e51NO0PtyjKwTdzVQ/Q7d4xDXYtPs.jpg?size=200x250&quality=96&sign=29db4677d5563a78d8e527cbc94cfdbf&c_uniq_tag=Lm67v8w6e7pHT6tacr5fZpvBDE10fLE3jtSNcqt778g&type=album', 'type': 'p', 'width': 200}, {'height': 400, 'url': 'https://sun1-99.userapi.com/impg/_OsTsnycnl5ymGUVLtsV5e51NO0PtyjKwTdzVQ/Q7d4xDXYtPs.jpg?size=320x400&quality=96&sign=948c2783c72296dfb7133fe952f1aa94&c_uniq_tag=QpqTxOqZ_22JGP4FrAdkbBzLpM80_SbFEALNDtUgSCk&type=album', 'type': 'q', 'width': 320}, {'height': 638, 'url': 'https://sun1-99.userapi.com/impg/_OsTsnycnl5ymGUVLtsV5e51NO0PtyjKwTdzVQ/Q7d4xDXYtPs.jpg?size=510x638&quality=96&sign=6332e90fb4db6673fd62728635c660e3&c_uniq_tag=N0ELrguseARoilzcKQ2ylUqvXJadxYJ3y25XSP7CRP4&type=album', 'type': 'r', 'width': 510}, {'height': 75, 'url': 'https://sun1-99.userapi.com/impg/_OsTsnycnl5ymGUVLtsV5e51NO0PtyjKwTdzVQ/Q7d4xDXYtPs.jpg?size=60x75&quality=96&sign=cd05f05905dfb8458bdefd3eea743a29&c_uniq_tag=Vn2L4EDztaMkXwDNAey-mEAWrDiLhxYEX6MVtDobGdo&type=album', 'type': 's', 'width': 60}, {'height': 1350, 'url': 'https://sun1-99.userapi.com/impg/_OsTsnycnl5ymGUVLtsV5e51NO0PtyjKwTdzVQ/Q7d4xDXYtPs.jpg?size=1080x1350&quality=96&proxy=1&sign=dbab5c01463d7ed10a6949939f80a132&c_uniq_tag=36bc6IaSqlMBtImI86M5o8XLCg6n3ex0R5LDTOrRD9s&type=album', 'type': 'w', 'width': 1080}, {'height': 604, 'url': 'https://sun1-99.userapi.com/impg/_OsTsnycnl5ymGUVLtsV5e51NO0PtyjKwTdzVQ/Q7d4xDXYtPs.jpg?size=483x604&quality=96&sign=d556a69a398ba7bc439bd7f39e4cad9e&c_uniq_tag=cuH2KStHtbKgP24NdSFsr8YIfY7n8ykCvkuZQbfMErY&type=album', 'type': 'x', 'width': 483}, {'height': 807, 'url': 'https://sun1-99.userapi.com/impg/_OsTsnycnl5ymGUVLtsV5e51NO0PtyjKwTdzVQ/Q7d4xDXYtPs.jpg?size=646x807&quality=96&sign=b1aa6e5b91cd5574ea75221edd8c5e9f&c_uniq_tag=mlcHmZbAtp3J-2jMcktonkLgtCPDa6RDT0EHXulPMtY&type=album', 'type': 'y', 'width': 646}, {'height': 1080, 'url': 'https://sun1-99.userapi.com/impg/_OsTsnycnl5ymGUVLtsV5e51NO0PtyjKwTdzVQ/Q7d4xDXYtPs.jpg?size=864x1080&quality=96&sign=e3534ef7c0df5686f7bdc6a7879b922f&c_uniq_tag=runIwZBNkxacsBGwEP53veguNCtLIPnFiiyNSDD6CSc&type=album', 'type': 'z', 'width': 864}], 'text': '', 'user_id': 100}}, {'type': 'photo', 'photo': {'album_id': -7, 'date': 1611403474, 'id': 457514025, 'owner_id': -66669811, 'has_tags': False, 'access_key': '0ae40b2770c7560d62', 'sizes': [{'height': 130, 'url': 'https://sun1-90.userapi.com/impg/N-4w-JlVzKSeShqQ5Ewq-RAPNuK0OJU8HrRIcQ/LY7X59hAMzA.jpg?size=104x130&quality=96&sign=93ac500dab56b2d874b571c5f696ab71&c_uniq_tag=e8zcv8hgW_gI8IPvh5aY_NEzTQcgTsmyXZxXTZ9RYGk&type=album', 'type': 'm', 'width': 104}, {'height': 163, 'url': 'https://sun1-90.userapi.com/impg/N-4w-JlVzKSeShqQ5Ewq-RAPNuK0OJU8HrRIcQ/LY7X59hAMzA.jpg?size=130x163&quality=96&sign=6ef69a006d7a4c1df82abb03558bdde1&c_uniq_tag=2ImW93sGD4LF5A8MNXFiJ7JGmka3hnl33AKpf95-YKo&type=album', 'type': 'o', 'width': 130}, {'height': 250, 'url': 'https://sun1-90.userapi.com/impg/N-4w-JlVzKSeShqQ5Ewq-RAPNuK0OJU8HrRIcQ/LY7X59hAMzA.jpg?size=200x250&quality=96&sign=b4983a571b1338523e5ade8c3b53bc50&c_uniq_tag=9r-StTKTajySCkmX72WObpGvZG_JiVO1WA2QrNBYUUY&type=album', 'type': 'p', 'width': 200}, {'height': 400, 'url': 'https://sun1-90.userapi.com/impg/N-4w-JlVzKSeShqQ5Ewq-RAPNuK0OJU8HrRIcQ/LY7X59hAMzA.jpg?size=320x400&quality=96&sign=2faee8c49f789dfd7cee431e3020c5d4&c_uniq_tag=f2XWz0s8UV12cOCtiyJ2U54hKhk0mZnOr2ly1nWX1vo&type=album', 'type': 'q', 'width': 320}, {'height': 638, 'url': 'https://sun1-90.userapi.com/impg/N-4w-JlVzKSeShqQ5Ewq-RAPNuK0OJU8HrRIcQ/LY7X59hAMzA.jpg?size=510x638&quality=96&sign=aa5c8a52428c328e0c24e9bc6409bb07&c_uniq_tag=OpR-TWimMiRrvBN_DjiWyPSeYcNHob4K0POAhm1Lr8E&type=album', 'type': 'r', 'width': 510}, {'height': 75, 'url': 'https://sun1-90.userapi.com/impg/N-4w-JlVzKSeShqQ5Ewq-RAPNuK0OJU8HrRIcQ/LY7X59hAMzA.jpg?size=60x75&quality=96&sign=cae82cd2a641d7739751bfc1027100e5&c_uniq_tag=fcD53ZDt70vx1-3M04Rde9dgFyjC7a8QbyHpRhRKHTM&type=album', 'type': 's', 'width': 60}, {'height': 1350, 'url': 'https://sun1-90.userapi.com/impg/N-4w-JlVzKSeShqQ5Ewq-RAPNuK0OJU8HrRIcQ/LY7X59hAMzA.jpg?size=1080x1350&quality=96&proxy=1&sign=dcad4ca8218e2aa7b7fb216d9a911069&c_uniq_tag=5jbfG0IAgZ1tajQUFQVm019gRPDq0jLnxwn19VDkjgY&type=album', 'type': 'w', 'width': 1080}, {'height': 604, 'url': 'https://sun1-90.userapi.com/impg/N-4w-JlVzKSeShqQ5Ewq-RAPNuK0OJU8HrRIcQ/LY7X59hAMzA.jpg?size=483x604&quality=96&sign=955d904ccb7bc265dd3e2e74a433f68e&c_uniq_tag=jRQ-QgjhfHLK2jSPvH5jmwJKR8Pl2BNmX-WyxEHNV3k&type=album', 'type': 'x', 'width': 483}, {'height': 807, 'url': 'https://sun1-90.userapi.com/impg/N-4w-JlVzKSeShqQ5Ewq-RAPNuK0OJU8HrRIcQ/LY7X59hAMzA.jpg?size=646x807&quality=96&sign=d23aa2cc098864567977e6f68049db94&c_uniq_tag=owRr1-h-xB3iCEPCQi4nI_gQQnMahVCKbjGA92MMEAM&type=album', 'type': 'y', 'width': 646}, {'height': 1080, 'url': 'https://sun1-90.userapi.com/impg/N-4w-JlVzKSeShqQ5Ewq-RAPNuK0OJU8HrRIcQ/LY7X59hAMzA.jpg?size=864x1080&quality=96&sign=84dc82964100923fb6b67a987608cbcb&c_uniq_tag=xN0t_n-DXMZTrukaE2KACmM41jFljGXlgIENQjHszT0&type=album', 'type': 'z', 'width': 864}], 'text': '', 'user_id': 100}}, {'type': 'photo', 'photo': {'album_id': -7, 'date': 1611403474, 'id': 457514026, 'owner_id': -66669811, 'has_tags': False, 'access_key': '807127461d3fdef686', 'sizes': [{'height': 130, 'url': 'https://sun1-15.userapi.com/impg/UKQDf5xOoPm2SDVRCw1a8ywZDQF-u0AAWGjvzA/1-3tLVBmoNo.jpg?size=104x130&quality=96&sign=c89dc418aa025849bb5d924bf2a1223a&c_uniq_tag=N3WJLa1umsDXbK_lxXGMgyMlmxdumCXCBI190bLuYF8&type=album', 'type': 'm', 'width': 104}, {'height': 163, 'url': 'https://sun1-15.userapi.com/impg/UKQDf5xOoPm2SDVRCw1a8ywZDQF-u0AAWGjvzA/1-3tLVBmoNo.jpg?size=130x163&quality=96&sign=a9989cbac264a3bd03fdf3216fd39e0c&c_uniq_tag=UAZ6NL46MN9E9IHiDvJ4gdiND65C6bAY197dznmICVc&type=album', 'type': 'o', 'width': 130}, {'height': 250, 'url': 'https://sun1-15.userapi.com/impg/UKQDf5xOoPm2SDVRCw1a8ywZDQF-u0AAWGjvzA/1-3tLVBmoNo.jpg?size=200x250&quality=96&sign=4a452d0c56be93bca1e5d181271e61d1&c_uniq_tag=txhKOLTKUAT55CqskwZPdKp0S3v41qC5EaFJ0XNDHaE&type=album', 'type': 'p', 'width': 200}, {'height': 400, 'url': 'https://sun1-15.userapi.com/impg/UKQDf5xOoPm2SDVRCw1a8ywZDQF-u0AAWGjvzA/1-3tLVBmoNo.jpg?size=320x400&quality=96&sign=974d14e42d401d3dffea03f7f4f3db5d&c_uniq_tag=S155CxcyLlIv_wg4IJnGxHjDaGFwYQwQ66-XHH6p9Fo&type=album', 'type': 'q', 'width': 320}, {'height': 638, 'url': 'https://sun1-15.userapi.com/impg/UKQDf5xOoPm2SDVRCw1a8ywZDQF-u0AAWGjvzA/1-3tLVBmoNo.jpg?size=510x638&quality=96&sign=ff372a2b888a9b6892653aeab62f1251&c_uniq_tag=N5hsR_91C69-Vc02w1qJH_8Sm--i5Pr7zwfdRbrKU2Y&type=album', 'type': 'r', 'width': 510}, {'height': 75, 'url': 'https://sun1-15.userapi.com/impg/UKQDf5xOoPm2SDVRCw1a8ywZDQF-u0AAWGjvzA/1-3tLVBmoNo.jpg?size=60x75&quality=96&sign=06f09f76899ea8de64eca35896cd02f1&c_uniq_tag=kk86doZqLH0FcWAxJXHzOzgKSv5-tVPvsi2FvzRTuLE&type=album', 'type': 's', 'width': 60}, {'height': 1350, 'url': 'https://sun1-15.userapi.com/impg/UKQDf5xOoPm2SDVRCw1a8ywZDQF-u0AAWGjvzA/1-3tLVBmoNo.jpg?size=1080x1350&quality=96&proxy=1&sign=a29d45193a3853472ca556235d04614a&c_uniq_tag=DvDt6EWRUQ2mc2-vVzu5SruT0PvNt2pJkciUbS1X3jg&type=album', 'type': 'w', 'width': 1080}, {'height': 604, 'url': 'https://sun1-15.userapi.com/impg/UKQDf5xOoPm2SDVRCw1a8ywZDQF-u0AAWGjvzA/1-3tLVBmoNo.jpg?size=483x604&quality=96&sign=5de5fe871c078ef9516e922f5da2b05f&c_uniq_tag=7kDFbdwpybw16POswM_BrTex9OYIb3Y7N87Y8yGb5X4&type=album', 'type': 'x', 'width': 483}, {'height': 807, 'url': 'https://sun1-15.userapi.com/impg/UKQDf5xOoPm2SDVRCw1a8ywZDQF-u0AAWGjvzA/1-3tLVBmoNo.jpg?size=646x807&quality=96&sign=eeb79933ee8cac0a63c40607186ef0ec&c_uniq_tag=RSYhcsdDRLs-03KWwv0nkkNb1gvWmFkj0urA97B8EyE&type=album', 'type': 'y', 'width': 646}, {'height': 1080, 'url': 'https://sun1-15.userapi.com/impg/UKQDf5xOoPm2SDVRCw1a8ywZDQF-u0AAWGjvzA/1-3tLVBmoNo.jpg?size=864x1080&quality=96&sign=b17614ec740845d457fa45618383bb48&c_uniq_tag=OBJoBPoZMy3cPlNx3p7TB5WJvokAFhB_RX6D2azTsXQ&type=album', 'type': 'z', 'width': 864}], 'text': '', 'user_id': 100}}, {'type': 'photo', 'photo': {'album_id': -7, 'date': 1611403474, 'id': 457514027, 'owner_id': -66669811, 'has_tags': False, 'access_key': 'abe89d833fcc407e0a', 'sizes': [{'height': 130, 'url': 'https://sun1-28.userapi.com/impg/qMXGQ4sJIe2VUV8Wl8VOLw6HkZxDPm80Kbvxyw/GA80fwmqaPw.jpg?size=104x130&quality=96&sign=5610dcf298ecf506338788b0ea797595&c_uniq_tag=zaCwrAlnqthPezb7-04GOMj-w_6NGHxt0XT3sojAjTo&type=album', 'type': 'm', 'width': 104}, {'height': 163, 'url': 'https://sun1-28.userapi.com/impg/qMXGQ4sJIe2VUV8Wl8VOLw6HkZxDPm80Kbvxyw/GA80fwmqaPw.jpg?size=130x163&quality=96&sign=043d920468566c4eed170d2632166602&c_uniq_tag=0x-nB27PiXILWNiWOb2NNgpeVKv9CIYN6EkcHr1BQJ8&type=album', 'type': 'o', 'width': 130}, {'height': 250, 'url': 'https://sun1-28.userapi.com/impg/qMXGQ4sJIe2VUV8Wl8VOLw6HkZxDPm80Kbvxyw/GA80fwmqaPw.jpg?size=200x250&quality=96&sign=6d2b68c93056a2e4833e1a1fec17b9c8&c_uniq_tag=607s-Yg1rzU9OMxIMgGRYJ2bNeEyoTDyHSjMAtSnJU0&type=album', 'type': 'p', 'width': 200}, {'height': 400, 'url': 'https://sun1-28.userapi.com/impg/qMXGQ4sJIe2VUV8Wl8VOLw6HkZxDPm80Kbvxyw/GA80fwmqaPw.jpg?size=320x400&quality=96&sign=4da579e1f1443effbb4e1d8eb9d88147&c_uniq_tag=EYaIrIXqCjCQPVZQbCo6z4DDlM3e9i9b-PC_yssazWM&type=album', 'type': 'q', 'width': 320}, {'height': 638, 'url': 'https://sun1-28.userapi.com/impg/qMXGQ4sJIe2VUV8Wl8VOLw6HkZxDPm80Kbvxyw/GA80fwmqaPw.jpg?size=510x638&quality=96&sign=1992a225ee04f87b742007046de77803&c_uniq_tag=bCC3Ld4c0EHm4jx4oEhXnOHAFEnia4VJ2aJ3JJJN8Eo&type=album', 'type': 'r', 'width': 510}, {'height': 75, 'url': 'https://sun1-28.userapi.com/impg/qMXGQ4sJIe2VUV8Wl8VOLw6HkZxDPm80Kbvxyw/GA80fwmqaPw.jpg?size=60x75&quality=96&sign=057a033f3b9c3be904b515259e4d1ed7&c_uniq_tag=qALgvLdReJvLp7Ef27CIJXxhGYLBcW-7bkIKDHSSEzs&type=album', 'type': 's', 'width': 60}, {'height': 1350, 'url': 'https://sun1-28.userapi.com/impg/qMXGQ4sJIe2VUV8Wl8VOLw6HkZxDPm80Kbvxyw/GA80fwmqaPw.jpg?size=1080x1350&quality=96&proxy=1&

In [13]:
date = 1566840605
dt = (datetime.fromtimestamp(date) - timedelta(hours=0)).strftime('%Y-%m-%d %H:%M:%S')

print(dt)

2019-08-26 20:30:05

The Zen of Python, by Tim Peters

Beautiful is better than ugly.
Explicit is better than implicit.
Simple is better than complex.
Complex is better than complicated.
Flat is better than nested.
Sparse is better than dense.
Readability counts.
Special cases aren't special enough to break the rules.
Although practicality beats purity.
Errors should never pass silently.
Unless explicitly silenced.
In the face of ambiguity, refuse the temptation to guess.
There should be one-- and preferably only one --obvious way to do it.
Although that way may not be obvious at first unless you're Dutch.
Now is better than never.
Although never is often better than *right* now.
If the implementation is hard to explain, it's a bad idea.
If the implementation is easy to explain, it may be a good idea.
Namespaces are one honking great idea -- let's do more of those!